benchmark_results/actor_model.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
Connection error: Connection refused
Connection error: Connection refused
Connection error: Connection refused
[...]
[RUN #1 50%,  15 secs]  0 threads:     2011809 ops,  134348 (avg:  134117) ops/sec, 9.65MB/sec (avg: 9.64MB/sec),  1.49 (avg:  1.49) msec latency

8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       101606.81          ---          ---         1.49133         1.48700         1.61500         2.36700      7828.06 
Gets        10157.64        11.11     10146.53         1.48968         1.48700         1.62300         2.25500       396.07 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     111764.45        11.11     10146.53         1.49118         1.48700         1.61500         2.33500      8224.13