benchmark_results/profiling-benchmark-results.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
Connection error: Connection refused
Connection error: Connection refused
Connection error: Connection refused
[...]
[RUN #1 50%,  15 secs]  0 threads:     2008457 ops,  134658 (avg:  133893) ops/sec, 9.67MB/sec (avg: 9.62MB/sec),  1.48 (avg:  1.49) msec latency

8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       101436.74          ---          ---         1.49386         1.48700         1.70300         2.67100      7814.98 
Gets        10140.92        11.11     10129.81         1.49108         1.48700         1.69500         2.35100       395.42 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     111577.67        11.11     10129.81         1.49361         1.48700         1.70300         2.63900      8210.40