benchmark_results/redis.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     1940805 ops,   62423 (avg:   64690) ops/sec, 4.58MB/sec (avg: 4.74MB/sec),  3.20 (avg:  3.09) msec latency

8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        58812.09          ---          ---         3.09181         3.08700         3.91900        10.43100      4530.92 
Gets         5877.92      2953.44      2924.48         3.08874         3.08700         3.90300         9.98300       327.09 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      64690.00      2953.44      2924.48         3.09153         3.08700         3.91900        10.36700      4858.01