benchmark_results/redis.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2015065 ops,   68817 (avg:   67165) ops/sec, 4.95MB/sec (avg: 4.83MB/sec),  2.91 (avg:  2.98) msec latency

8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        61062.98          ---          ---         2.97773         2.89500         5.82300        15.99900      4704.39 
Gets         6102.86         0.00      6102.86         2.97484         2.89500         5.82300        14.65500       237.81 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      67165.84         0.00      6102.86         2.97747         2.89500         5.82300        15.93500      4942.20