benchmark_results/single_lock.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
Connection error: Connection refused
Connection error: Connection refused
Connection error: Connection refused
[...]
[RUN #1 50%,  15 secs]  0 threads:     2169650 ops,  146751 (avg:  144640) ops/sec, 10.54MB/sec (avg: 10.39MB/sec),  1.36 (avg:  1.38) msec latency

8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       131493.48          ---          ---         1.38271         1.36700         1.65500         6.20700     10130.56 
Gets        13146.42        13.33     13133.09         1.38169         1.36700         1.65500         5.72700       512.56 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     144639.90        13.33     13133.09         1.38262         1.36700         1.65500         6.17500     10643.13